# HW16. Задача на безлічі
"""
Даны два списка чисел. Посчитайте, сколько (уникальных) чисел содержится одновременно как в первом списке,
так и во втором. - Примечание. Эту задачу на Питоне можно решить в одну строчку.
(Задача решается с применением множеств)
"""

from random import randint

lst1 = [randint(10, 99) for _ in range(25)]
lst2 = [randint(10, 99) for _ in range(25)]
print('Перелік випадкових чисел: ', lst1)
print('Перелік випадкових чисел: ', lst2)
print()

A = set(lst1)
B = set(lst2)

print('Кількість значень, які є в обох переліках випадкових чисел: ', len(A.intersection(B)))
print()
print('Значення, які є в обох переліках випадкових чисел: ', A.intersection(B))
