# HW20. Функцiя season

"""
Написать функцию season, принимающую 1 аргумент — номер месяца (от 1 до 12),
и возвращающую время года (в виде строки), которому этот месяц принадлежит
(зима, весна, лето или осень).
"""

Month = int(input("Введіть номер місяця від 1 до 12, щоб з'ясувати пору року: "))


def season():
    if Month in ( 1, 2, 12):
        return "Зима"
    elif Month in (3, 4, 5):
        return "Весна"
    elif Month in (6, 7, 8):
        return "Літо"
    elif Month in (9, 10, 11):
        return "Осінь"
    else:
        return "Номер місяця задан невірно"


print(season())
