# HW29 Перелік студентів.
# . В таблице scr_14.txt, построчно записаны имя и фамилия учащихся класса и их оценки.
# Андрей Говорухи               6  6  1  4  9  9  10 4  8  2  3  8
# Василий Петров                2  9  4  7  6  6  3  6  5  5  2  4
# Гавриил Варфаломеев           10 10 4  10 7  9  4  6  8  1  1  1
# Игнат Тюльпанов               8  1  4  1  1  5  2  5  2  2  10 8
# Илья Муромцев                 1  6  4  7  10 9  5  3  7  4  7  2
# Кощей Бессмертный             3  10 1  4  1  8  10 6  2  10 7  4
# Максим Мухин                  10 8  9  9  5  8  6  5  7  2  4  10
# Маргарита Мартынова           9  1  5  1  10 10 2  4  4  9  8  10
# Петр Николаев                 2  9  5  9  1  2  8  7  8  1  9  1
# Полина Гусева                 9  2  8  7  3  9  9  5  1  9  2  6
# Спиридов Тереньтьев           4  7  7  3  10 9  7  2  10 9  8  1
# Станислав Трердолобов         8  1  6  1  4  1  10 8  8  1  8  8
# Вывести на экран всех учащихся, чей средний балл меньше 5, также посчитать и вывести средний балл по классу.
# Так же, записать в новый файл всех учащихся в формате "Фамилия И. Ср. балл":
#  Говорухи А.     5.83
#  Петров В.       4.92
#  Варфаломеев Г.  5.92
#  Тюльпанов И.    4.08
#  Муромцев И.     5.42
#  Бессмертный К.  5.5
#  Мухин М.        6.92
#  Мартынова М.    6.08
#  Николаев П.     5.17
#  Гусева Г.       5.83
#  Тереньтьев С.   6.42
#  Трердолобов С.  5.33
#  Выравнивание колонок - ОБЯЗАТЕЛЬНО!

import os
from pprint import pprint as pp

GPA = 0
lst = []

file = open('scr_14.txt', encoding='utf-8')
file_new = open('scr_14_new.txt', 'w', encoding='utf-8')

while True:
    line = file.readline()
    if line:
        line = line.split()
        surname_name = line[1] + ' ' + line[0][0] + '.'
        grade = line[2:]
        lst.append(grade)
        GPA += sum([int(grade) for grade in grade])
        class_rating = round(sum([int(grade) for grade in grade]) / len(grade), 2)
        file_new.write('{:<15} {}'.format(surname_name, class_rating))
        file_new.write('\n')
        if class_rating < 5:
            print('{:<22} {}'.format(surname_name, class_rating))
    else:
        break

print()
print("Середня оцінка класу: ", round(GPA / len(sum(lst, [])), 2))

file.close()
file_new.close()
