# HW5.
# Шахматный конь ходит буквой “Г” — на две клетки по вертикали в любом направлении
# и на одну клетку по горизонтали, или наоборот. Даны две различные клетки шахматной доски
# (каждая клетка задаётся двумя числами определяющими координаты на положения на доске),
# определите, может ли конь попасть с первой клетки на вторую одним ходом.
# Понадобится оператор if, and, or плюс арифметические операторы.

x1 = int(input('Місцезнаходження коня по осі Х від 1 до 8: ', ))
y1 = int(input('Місцезнаходження коня по осі Y від 1 до 8: ', ))
x2 = int(input('Хід коня по осі Х від 1 до 8: ', ))
y2 = int(input('Хід коня по осі Y від 1 до 8: ', ))

if x2 - x1 == 2 and y2 - y1 == 1 or y1 - y2 == 1:
    print('Можливий хід коня')
elif x2 - x1 == 1 and y2 - y1 == 2 or y1 - y2 == 1:
    print('Можливий хід коня')
elif x1 - x2 == 2 and y1 - y2 == 1 or y2 - y1 == 1:
    print('Можливий хід коня')
elif x1 - x2 == 1 and y1 - y2 == 2 or y2 - y1 == 2:
    print('Можливий хід коня')
else:
    print('Не вірний хід коня')

