# Високосний рік HW6.
# Написать программу определяющую високосный год или нет.
# Пользователь вводит номер года, программа должна ответить високосный это год или нет.
# Алгоритм проверки високосного года можно посмотреть здесь, раздел "Григорианский календарь"
# Вам понадобится операторы IF, AND, OR.


y = int(input('Вкажіть рік для перевірки високосності: ', ))

if  y == 2100 or y == 2200 or y == 2300:
    print('Рік не високосний:', y)
elif y % 100 == 0 and y % 400 != 0:
    print('Рік не високосний:', y)
elif y % 4 == 0 or y % 400 == 0:
    print('Рік високосний:', y)
else:
    print('Рік не високосний:', y)

